#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//一、整数在内存中的存储
//整数的2进制表示方法有三种：原码、反码、补码
//有符号的整数，三种表示方法均有符号位和数值位两部分，符号位0表示正，1表示负，最高的一位表示符号位，剩余都是数值位
//正整数的原反补都相同
//负整数的三种表示方法各不同
//原码：直接将数值按正负数的形式翻译成二进制得到的就是原码
//反码：将原码符号位不变，其他位依次按位取反
//补码：反码+1
//对于整数来说，内存中存放的是补码
//计算使用的是内存中的二进制，计算使用的就是补码




//二、大小端字节序和字节序判断
//1.什么是大小端
//大端存储：是指数据的低位字节内容保存在内存的高地址处，而数据的高位字节内容保存在内存的低地址处
//小端存储：是指数据的低位字节内容保存在内存的低地址处，而数据的高位字节内容保存在内存的高地址处
//int main()
//{
//	int n = 0x11223344;
//	return 0;
//}
//在VS环境下，是小端存储


//练习1：设计一个小程序来判断当前机器的字节序
//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;//拿到第一个字节的地址
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//练习2：
//int main()
//{
//	char a = -1;
//	//11111111111111111111111111111111 -- 补码
//	//11111111 -- int类型存到char发生截断 -- 存到a里面
//	//11111111111111111111111111111111 -- %d打印 -- 整型提升 -- 补码
//	//10000000000000000000000000000001 -- a原码
//	signed char b = -1;
//	//b同理
//
//	unsigned char c = -1;
//	//11111111111111111111111111111111 -- 补码
//	//11111111 -- 截断后存到c
//	//00000000000000000000000011111111 -- 整型提升，无符号数提升高位补0
//	//无符号数原反补相同
//
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}


//练习3
//int main()
//{
//	char a = -128;
//	//111111111111111111111110000000 -- 补码
//	//10000000 -- int类型存储到char类型，截断
//	//111111111111111111111110000000 -- %u打印 -- 整型提升 -- 反码
//	//无符号打印，原反补相同
//	printf("%u\n", a);
//	return 0;
//}


//练习4：
//int main()
//{
//	char a = 128;
//	//00000000000000000000000010000000 -- 补码
//	//10000000 -- 截断，存储到a中
//	//11111111111111111111111110000000 -- 整型提升 -- 补码
//	//无符号打印，原反补相同
//	printf("%u\n", a);
//	return 0;
//}



//三、浮点数在内存中的存储
