#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//一、操作符的分类
//算术操作符: +  -  *  /  %
//移位操作符: <<  >>     --- 移动的是存储在内存中的二进制位
//位操作符: &  |  ^  ~      --- 也是使用二进制位进行计算
//赋值操作符: =  +=  -=  *=  /=  %=  <<=  >>=  &=  |=  ^=
//单目操作符: !  ++  --   &  *  +  -  ~  sizeof  (类型)
//关系操作符: >  >=  <  <=  ==  !=
//逻辑操作符: &&  ||
//条件操作符: ?  :
//逗号表达式: ,
//下标引用: []
//函数调用: ()
//结构成员访问: .  ->




//二、移位操作符
//移位操作符的操作数只能是整数
//1.左移操作符
//左边丢弃，右边补零
//int main()
//{
//	int a = 10;
//	int b = a << 1;//a本身是不会改变的
//	//00000000000000000000000000001010 -- a的补码
//	//00000000000000000000000000010100 -- a左移一位
//	printf("%d\n", b);
//
//	return 0;
//}


//int main()
//{
//	int a = -1;
//	int b = a << 1;
//	//11111111111111111111111111111111 -- a的补码
//	//11111111111111111111111111111110 -- b的补码
//	//10000000000000000000000000000010 -- b的原码
//	printf("%d\n", b);
//	return 0;
//}


//2.右移操作符
//逻辑右移：左边补零，右边丢弃
//算术右移：左边补符号位，右边丢弃
//右移到底采用哪种方式是取决于编译器的，通常采用的都是算术右移
//int main()
//{
//	int a = -10;
//	int b = a >> 1;
//	//11111111111111111111111111110110 -- a的补码
//	//11111111111111111111111111111011 -- b的补码
//	//10000000000000000000000000000101 -- b的原码
//	printf("%d\n", b);
//	return 0;
//}




//三、位操作符
//它们的操作数都只能是整数
//1.按位与  &
//int main()
//{
//	int a = 6;
//	int b = -7;
//	int c = a & b;//a和b的补码的二进制位进行运算
//	//00000000000000000000000000000110 -- a的补码
//	//11111111111111111111111111111001 -- b的补码
//	//00000000000000000000000000000000 -- c的补码/原码
//	printf("%d\n", c);
//	return 0;
//}


//2.按位或  |
//int main()
//{
//	int a = 6;
//	int b = -7;
//	int c = a | b;//a和b的补码的二进制位进行运算
//	//00000000000000000000000000000110 -- a的补码
//  //11111111111111111111111111111001 -- b的补码
//	//11111111111111111111111111111111 -- c的补码
//	//10000000000000000000000000000001 -- c的原码
//	printf("%d\n", c);
//	return 0;
//}


//3.按位异或  ^
//规则：对应的二进制位，相同为0，相异为1
//int main()
//{
//	int a = 6;
//	int b = -7;
//	int c = a ^ b;
//	//00000000000000000000000000000110 -- a的补码
//    //11111111111111111111111111111001 -- b的补码
//	//11111111111111111111111111111111 -- c的补码
//	//10000000000000000000000000000001 -- c的原码
//	printf("%d\n", c);
//	return 0;
//}


//4.按位取反  ~
//int main()
//{
//	int a = 0;
//	//00000000000000000000000000000000 -- a的补码
//	//11111111111111111111111111111111 -- a按位取反，补码
//	//10000000000000000000000000000001 -- 原码
//	printf("%d\n", ~a);
//	return 0;
//}


//面试题：不创建临时变量(第三个变量)，实现两个整数的交换
//写法1：
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前：a = %d , b = %d\n", a, b);
//	a = a + b;
//	b = a - b;//b==3
//	a = a - b;
//	printf("交换后：a = %d , b = %d\n", a, b);
//	return 0;
//}


//写法2：
//异或操作符的特点
//a^a=0    0^a=a
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前：a = %d , b = %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;//a ^ b ^ b == a
//	a = a ^ b;//a ^ b ^ a == b 
//	printf("交换后：a = %d , b = %d\n", a, b);
//	return 0;
//}


//练习：编写代码实现：求一个整数存储在内存中的二进制中1的个数
//写法1：
//int count_bit_one(int n)
//{
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((n >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//	return count;
//}
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int ret = count_bit_one(num);
//	printf("%d\n", ret);
//	return 0;
//}


//写法2：
//n = n&(n-1)  -->  把n的二进制序列中的最右边的1去掉了
//int count_bit_one(int n)
//{
//	int i = 0;
//	int count = 0;
//	while (n)
//	{
//		n = n & (n - 1);
//		count++;
//	}
//	return count;
//}
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int ret = count_bit_one(num);
//	printf("%d\n", ret);
//	return 0;
//}


//练习：写一个代码判断n是否是2的次方数
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	if ((n & (n - 1)) == 0)
//	{
//		printf("是2的次方数\n");
//	}
//	else
//	{
//		printf("不是2的次方数\n");
//	}
//	return 0;
//}


//练习：编写代码将13二进制序列的第n位修改为1，然后再改回0
//int main()
//{
//	int a = 13;
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000
//	int n = 5;
//	a = a | (1 << (n - 1));
//	printf("%d\n", a);
//
//	a = a & ~(1 << (n - 1));
//	printf("%d\n", a);
//	return 0;
//}




//四、逗号表达式
//从左向右依次执行，整个表达式的结果是最后一个表达式的结果
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, b = a + 1);
//	printf("%d\n", c);//13
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	if (a = b + 1, c = 1 / 2, d > 0)
//	{
//
//	}
//	return 0;
//}




//五、下标访问，函数调用
//1.下标访问操作符
//int main()
//{
//	int arr[10] = { 1,2,3,4,5 };
//	int m = arr[4];//数组中下标是4的元素
//	// []  -->  下标引用操作符 -- 操作数是：arr,4
//	printf("%d\n", m);
//	return 0;
//}


//2.函数调用操作符
//int Add(int x, int y)
//{
//	return x + y;
//}
//int main()
//{
//	printf("%d\n", 100);
//	// ()  -->  函数调用操作符
//	//操作数是：printf  ""  100
//
//	int ret = Add(3, 5);
//	//操作数是：Add  3  5
//	return 0;
//}




//六、结构成员访问操作符
//1.结构体
//结构是一些值的集合，这些值称为成员变量，结构的每个成员可以是不同的类型


//2.结构体的定义和初始化
//学生类型
//struct Student
//{
//	//成员变量
//	char name[20];
//	int age;
//	float score;
//};
//int main()
//{
//	struct Student s1 = { "zhangsan",20,98.0 };
//	struct Student s2 = { "lisi",18,69.8 };
//	return 0;
//}


//3.结构成员访问操作符
//结构体变量.结构体成员名（直接访问）
//结构体变量->结构体成员名（间接访问，依赖于指针）
//struct Student
//{
//	//成员变量
//	char name[20];
//	int age;
//	float score;
//};
//int main()
//{
//	struct Student s1 = { "zhangsan",20,98.0 };
//	struct Student s2 = { "lisi",18,69.8 };
//
//	printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	return 0;
//}




//七、表达式求值
//1.整型提升
//有符号整数提升是按照变量的数据类型的符号位来提升的
//无符号整数提升，高位补0
//int main()
//{
//	char a = 20;
//	//0000000000000000000000000000000000010100 -- 20
//	//00010100 -- 放到a里面
//	char b = 130;
//	//0000000000000000000000000000000010000010 -- 130
//	//10000010 -- 放到b里面
//	char c = a + b;
//	//0000000000000000000000000000000000010100 -- a
//	//1111111111111111111111111111111110000010 -- b
//	//1111111111111111111111111111111110010110 -- a+b补码
//	//10010110 -- 截断，放到c里面
//	//1111111111111111111111111111111110010110 -- c整型提升 补码
//	//1000000000000000000000000000000001101010 -- c原码
//
//	printf("%d\n", c);
//	return 0;
//}
//整型提升讨论的是表达式中char和short类型的值



